; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-6-3-40)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	package27 - package
	package28 - package
	package29 - package
	package30 - package
	package31 - package
	package32 - package
	package33 - package
	package34 - package
	package35 - package
	package36 - package
	package37 - package
	package38 - package
	package39 - package
	package40 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p0-1 - location
	p1-3 - location
	p2-0 - location
	p3-1 - location
	p3-2 - location
	p3-4 - location
	p4-3 - location
	p4-5 - location
	p5-1 - location
	p5-3 - location
	)
	(:init
	(at driver1 s3)
	(at driver2 s2)
	(at driver3 s3)
	(at driver4 s0)
	(at driver5 s2)
	(at driver6 s2)
	(at truck1 s3)
	(empty truck1)
	(at truck2 s5)
	(empty truck2)
	(at truck3 s4)
	(empty truck3)
	(at package1 s5)
	(at package2 s4)
	(at package3 s2)
	(at package4 s2)
	(at package5 s0)
	(at package6 s5)
	(at package7 s2)
	(at package8 s5)
	(at package9 s0)
	(at package10 s1)
	(at package11 s2)
	(at package12 s1)
	(at package13 s1)
	(at package14 s2)
	(at package15 s4)
	(at package16 s3)
	(at package17 s0)
	(at package18 s5)
	(at package19 s5)
	(at package20 s0)
	(at package21 s4)
	(at package22 s1)
	(at package23 s1)
	(at package24 s5)
	(at package25 s0)
	(at package26 s2)
	(at package27 s4)
	(at package28 s0)
	(at package29 s3)
	(at package30 s4)
	(at package31 s2)
	(at package32 s3)
	(at package33 s4)
	(at package34 s4)
	(at package35 s2)
	(at package36 s1)
	(at package37 s0)
	(at package38 s0)
	(at package39 s4)
	(at package40 s3)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(link s0 s1)
	(link s1 s0)
	(link s0 s3)
	(link s3 s0)
	(link s0 s5)
	(link s5 s0)
	(link s1 s4)
	(link s4 s1)
	(link s2 s0)
	(link s0 s2)
	(link s2 s3)
	(link s3 s2)
	(link s2 s4)
	(link s4 s2)
	(link s2 s5)
	(link s5 s2)
	(link s3 s5)
	(link s5 s3)
	(link s4 s0)
	(link s0 s4)
	(link s4 s3)
	(link s3 s4)
	(link s5 s1)
	(link s1 s5)
	(link s5 s4)
	(link s4 s5)
)
	(:goal (and
	(at driver1 s1)
	(at driver3 s0)
	(at driver4 s3)
	(at driver5 s3)
	(at driver6 s2)
	(at package1 s5)
	(at package2 s2)
	(at package3 s4)
	(at package4 s1)
	(at package5 s2)
	(at package6 s4)
	(at package7 s1)
	(at package9 s4)
	(at package10 s3)
	(at package11 s2)
	(at package12 s1)
	(at package13 s3)
	(at package14 s5)
	(at package15 s0)
	(at package16 s5)
	(at package17 s2)
	(at package18 s2)
	(at package19 s2)
	(at package20 s3)
	(at package21 s0)
	(at package22 s1)
	(at package23 s3)
	(at package24 s0)
	(at package25 s5)
	(at package26 s2)
	(at package27 s2)
	(at package28 s2)
	(at package29 s2)
	(at package30 s2)
	(at package31 s0)
	(at package32 s1)
	(at package33 s3)
	(at package34 s3)
	(at package35 s3)
	(at package36 s0)
	(at package37 s4)
	(at package38 s5)
	(at package40 s0)
	))


)

; plan
1. (board-truck driver1 s3 truck1)
   deleted: (at driver1 s3) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 6 of 43
2. (drive-truck driver1 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 6 of 43
3. (load-truck s0 package9 truck1)
   deleted: (at package9 s0)
   added: (in package9 truck1)
   goals met: 6 of 43
4. (drive-truck driver1 s0 s4 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   goals met: 6 of 43
5. (unload-truck s4 package9 truck1)
   deleted: (in package9 truck1)
   added: (at package9 s4)
   goals met: 7 of 43
6. (load-truck s4 package34 truck1)
   deleted: (at package34 s4)
   added: (in package34 truck1)
   goals met: 7 of 43
7. (drive-truck driver1 s4 s0 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   goals met: 7 of 43
8. (load-truck s0 package5 truck1)
   deleted: (at package5 s0)
   added: (in package5 truck1)
   goals met: 7 of 43
9. (load-truck s0 package38 truck1)
   deleted: (at package38 s0)
   added: (in package38 truck1)
   goals met: 7 of 43
10. (drive-truck driver1 s0 s4 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   goals met: 7 of 43
11. (load-truck s4 package33 truck1)
   deleted: (at package33 s4)
   added: (in package33 truck1)
   goals met: 7 of 43
12. (load-truck s4 package30 truck1)
   deleted: (at package30 s4)
   added: (in package30 truck1)
   goals met: 7 of 43
13. (drive-truck driver1 s4 s0 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   goals met: 7 of 43
14. (load-truck s0 package37 truck1)
   deleted: (at package37 s0)
   added: (in package37 truck1)
   goals met: 7 of 43
15. (drive-truck driver1 s0 s4 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   goals met: 7 of 43
16. (unload-truck s4 package37 truck1)
   deleted: (in package37 truck1)
   added: (at package37 s4)
   goals met: 8 of 43
17. (drive-truck driver1 s4 s5 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s5)
   goals met: 8 of 43
18. (load-truck s5 package6 truck1)
   deleted: (at package6 s5)
   added: (in package6 truck1)
   goals met: 8 of 43
19. (drive-truck driver1 s5 s4 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s4)
   goals met: 8 of 43
20. (unload-truck s4 package6 truck1)
   deleted: (in package6 truck1)
   added: (at package6 s4)
   goals met: 9 of 43
21. (load-truck s4 package27 truck1)
   deleted: (at package27 s4)
   added: (in package27 truck1)
   goals met: 9 of 43
22. (drive-truck driver1 s4 s0 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   goals met: 9 of 43
23. (load-truck s0 package28 truck1)
   deleted: (at package28 s0)
   added: (in package28 truck1)
   goals met: 9 of 43
24. (drive-truck driver1 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 9 of 43
25. (load-truck s2 package7 truck1)
   deleted: (at package7 s2)
   added: (in package7 truck1)
   goals met: 9 of 43
26. (drive-truck driver1 s2 s5 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s5)
   goals met: 9 of 43
27. (unload-truck s5 package38 truck1)
   deleted: (in package38 truck1)
   added: (at package38 s5)
   goals met: 10 of 43
28. (load-truck s5 package24 truck1)
   deleted: (at package24 s5)
   added: (in package24 truck1)
   goals met: 10 of 43
29. (drive-truck driver1 s5 s0 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s0)
   goals met: 10 of 43
30. (load-truck s0 package25 truck1)
   deleted: (at package25 s0)
   added: (in package25 truck1)
   goals met: 10 of 43
31. (unload-truck s0 package24 truck1)
   deleted: (in package24 truck1)
   added: (at package24 s0)
   goals met: 11 of 43
32. (drive-truck driver1 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 11 of 43
33. (unload-truck s2 package5 truck1)
   deleted: (in package5 truck1)
   added: (at package5 s2)
   goals met: 12 of 43
34. (drive-truck driver1 s2 s4 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   goals met: 12 of 43
35. (load-truck s4 package21 truck1)
   deleted: (at package21 s4)
   added: (in package21 truck1)
   goals met: 12 of 43
36. (drive-truck driver1 s4 s0 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   goals met: 12 of 43
37. (unload-truck s0 package21 truck1)
   deleted: (in package21 truck1)
   added: (at package21 s0)
   goals met: 13 of 43
38. (drive-truck driver1 s0 s5 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   goals met: 13 of 43
39. (unload-truck s5 package25 truck1)
   deleted: (in package25 truck1)
   added: (at package25 s5)
   goals met: 14 of 43
40. (load-truck s5 package19 truck1)
   deleted: (at package19 s5)
   added: (in package19 truck1)
   goals met: 14 of 43
41. (drive-truck driver1 s5 s0 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s0)
   goals met: 14 of 43
42. (drive-truck driver1 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 14 of 43
43. (load-truck s2 package4 truck1)
   deleted: (at package4 s2)
   added: (in package4 truck1)
   goals met: 14 of 43
44. (drive-truck driver1 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 14 of 43
45. (load-truck s0 package20 truck1)
   deleted: (at package20 s0)
   added: (in package20 truck1)
   goals met: 14 of 43
46. (drive-truck driver1 s0 s4 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   goals met: 14 of 43
47. (load-truck s4 package2 truck1)
   deleted: (at package2 s4)
   added: (in package2 truck1)
   goals met: 14 of 43
48. (drive-truck driver1 s4 s2 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   goals met: 14 of 43
49. (load-truck s2 package35 truck1)
   deleted: (at package35 s2)
   added: (in package35 truck1)
   goals met: 14 of 43
50. (load-truck s2 package31 truck1)
   deleted: (at package31 s2)
   added: (in package31 truck1)
   goals met: 14 of 43
51. (drive-truck driver1 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 14 of 43
52. (unload-truck s0 package31 truck1)
   deleted: (in package31 truck1)
   added: (at package31 s0)
   goals met: 15 of 43
53. (load-truck s0 package17 truck1)
   deleted: (at package17 s0)
   added: (in package17 truck1)
   goals met: 15 of 43
54. (drive-truck driver1 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 15 of 43
55. (unload-truck s2 package30 truck1)
   deleted: (in package30 truck1)
   added: (at package30 s2)
   goals met: 16 of 43
56. (drive-truck driver1 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 16 of 43
57. (load-truck s3 package40 truck1)
   deleted: (at package40 s3)
   added: (in package40 truck1)
   goals met: 16 of 43
58. (drive-truck driver1 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 16 of 43
59. (unload-truck s0 package40 truck1)
   deleted: (in package40 truck1)
   added: (at package40 s0)
   goals met: 17 of 43
60. (drive-truck driver1 s0 s4 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   goals met: 17 of 43
61. (load-truck s4 package15 truck1)
   deleted: (at package15 s4)
   added: (in package15 truck1)
   goals met: 17 of 43
62. (drive-truck driver1 s4 s0 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   goals met: 17 of 43
63. (unload-truck s0 package15 truck1)
   deleted: (in package15 truck1)
   added: (at package15 s0)
   goals met: 18 of 43
64. (drive-truck driver1 s0 s5 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   goals met: 18 of 43
65. (load-truck s5 package18 truck1)
   deleted: (at package18 s5)
   added: (in package18 truck1)
   goals met: 18 of 43
66. (drive-truck driver1 s5 s2 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s2)
   goals met: 18 of 43
67. (load-truck s2 package3 truck1)
   deleted: (at package3 s2)
   added: (in package3 truck1)
   goals met: 18 of 43
68. (drive-truck driver1 s2 s4 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   goals met: 18 of 43
69. (unload-truck s4 package3 truck1)
   deleted: (in package3 truck1)
   added: (at package3 s4)
   goals met: 19 of 43
70. (walk driver3 s3 p3-2)
   deleted: (at driver3 s3)
   added: (at driver3 p3-2)
   goals met: 19 of 43
71. (walk driver3 p3-2 s2)
   deleted: (at driver3 p3-2)
   added: (at driver3 s2)
   goals met: 19 of 43
72. (walk driver3 s2 p2-0)
   deleted: (at driver3 s2)
   added: (at driver3 p2-0)
   goals met: 19 of 43
73. (walk driver3 p2-0 s0)
   deleted: (at driver3 p2-0)
   added: (at driver3 s0)
   goals met: 20 of 43
74. (walk driver4 s0 p2-0)
   deleted: (at driver4 s0)
   added: (at driver4 p2-0)
   goals met: 20 of 43
75. (walk driver4 p2-0 s2)
   deleted: (at driver4 p2-0)
   added: (at driver4 s2)
   goals met: 20 of 43
76. (walk driver4 s2 p3-2)
   deleted: (at driver4 s2)
   added: (at driver4 p3-2)
   goals met: 20 of 43
77. (walk driver4 p3-2 s3)
   deleted: (at driver4 p3-2)
   added: (at driver4 s3)
   goals met: 21 of 43
78. (walk driver5 s2 p3-2)
   deleted: (at driver5 s2)
   added: (at driver5 p3-2)
   goals met: 21 of 43
79. (walk driver5 p3-2 s3)
   deleted: (at driver5 p3-2)
   added: (at driver5 s3)
   goals met: 22 of 43
80. (drive-truck driver1 s4 s2 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   goals met: 22 of 43
81. (unload-truck s2 package28 truck1)
   deleted: (in package28 truck1)
   added: (at package28 s2)
   goals met: 23 of 43
82. (drive-truck driver1 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 23 of 43
83. (unload-truck s3 package35 truck1)
   deleted: (in package35 truck1)
   added: (at package35 s3)
   goals met: 24 of 43
84. (unload-truck s3 package34 truck1)
   deleted: (in package34 truck1)
   added: (at package34 s3)
   goals met: 25 of 43
85. (drive-truck driver1 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 25 of 43
86. (unload-truck s2 package27 truck1)
   deleted: (in package27 truck1)
   added: (at package27 s2)
   goals met: 26 of 43
87. (unload-truck s2 package2 truck1)
   deleted: (in package2 truck1)
   added: (at package2 s2)
   goals met: 27 of 43
88. (drive-truck driver1 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 27 of 43
89. (unload-truck s3 package33 truck1)
   deleted: (in package33 truck1)
   added: (at package33 s3)
   goals met: 28 of 43
90. (drive-truck driver1 s3 s5 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s5)
   goals met: 28 of 43
91. (drive-truck driver1 s5 s1 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   goals met: 28 of 43
92. (unload-truck s1 package7 truck1)
   deleted: (in package7 truck1)
   added: (at package7 s1)
   goals met: 29 of 43
93. (unload-truck s1 package4 truck1)
   deleted: (in package4 truck1)
   added: (at package4 s1)
   goals met: 30 of 43
94. (drive-truck driver1 s1 s5 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   goals met: 30 of 43
95. (drive-truck driver1 s5 s2 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s2)
   goals met: 30 of 43
96. (unload-truck s2 package19 truck1)
   deleted: (in package19 truck1)
   added: (at package19 s2)
   goals met: 31 of 43
97. (drive-truck driver1 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 31 of 43
98. (load-truck s3 package32 truck1)
   deleted: (at package32 s3)
   added: (in package32 truck1)
   goals met: 31 of 43
99. (drive-truck driver1 s3 s5 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s5)
   goals met: 31 of 43
100. (drive-truck driver1 s5 s1 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   goals met: 31 of 43
101. (load-truck s1 package36 truck1)
   deleted: (at package36 s1)
   added: (in package36 truck1)
   goals met: 31 of 43
102. (drive-truck driver1 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 31 of 43
103. (unload-truck s0 package36 truck1)
   deleted: (in package36 truck1)
   added: (at package36 s0)
   goals met: 32 of 43
104. (drive-truck driver1 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 32 of 43
105. (unload-truck s1 package32 truck1)
   deleted: (in package32 truck1)
   added: (at package32 s1)
   goals met: 33 of 43
106. (drive-truck driver1 s1 s5 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   goals met: 33 of 43
107. (drive-truck driver1 s5 s2 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s2)
   goals met: 33 of 43
108. (unload-truck s2 package18 truck1)
   deleted: (in package18 truck1)
   added: (at package18 s2)
   goals met: 34 of 43
109. (drive-truck driver1 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 34 of 43
110. (load-truck s3 package29 truck1)
   deleted: (at package29 s3)
   added: (in package29 truck1)
   goals met: 34 of 43
111. (drive-truck driver1 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 34 of 43
112. (unload-truck s2 package29 truck1)
   deleted: (in package29 truck1)
   added: (at package29 s2)
   goals met: 35 of 43
113. (drive-truck driver1 s2 s5 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s5)
   goals met: 35 of 43
114. (drive-truck driver1 s5 s1 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   goals met: 35 of 43
115. (load-truck s1 package23 truck1)
   deleted: (at package23 s1)
   added: (in package23 truck1)
   goals met: 35 of 43
116. (drive-truck driver1 s1 s5 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   goals met: 35 of 43
117. (drive-truck driver1 s5 s3 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   goals met: 35 of 43
118. (unload-truck s3 package23 truck1)
   deleted: (in package23 truck1)
   added: (at package23 s3)
   goals met: 36 of 43
119. (unload-truck s3 package20 truck1)
   deleted: (in package20 truck1)
   added: (at package20 s3)
   goals met: 37 of 43
120. (drive-truck driver1 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 37 of 43
121. (drive-truck driver1 s2 s5 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s5)
   goals met: 37 of 43
122. (drive-truck driver1 s5 s1 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   goals met: 37 of 43
123. (load-truck s1 package13 truck1)
   deleted: (at package13 s1)
   added: (in package13 truck1)
   goals met: 37 of 43
124. (drive-truck driver1 s1 s5 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   goals met: 37 of 43
125. (drive-truck driver1 s5 s2 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s2)
   goals met: 37 of 43
126. (unload-truck s2 package17 truck1)
   deleted: (in package17 truck1)
   added: (at package17 s2)
   goals met: 38 of 43
127. (drive-truck driver1 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 38 of 43
128. (load-truck s3 package16 truck1)
   deleted: (at package16 s3)
   added: (in package16 truck1)
   goals met: 38 of 43
129. (drive-truck driver1 s3 s5 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s5)
   goals met: 38 of 43
130. (unload-truck s5 package16 truck1)
   deleted: (in package16 truck1)
   added: (at package16 s5)
   goals met: 39 of 43
131. (drive-truck driver1 s5 s1 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   goals met: 39 of 43
132. (load-truck s1 package10 truck1)
   deleted: (at package10 s1)
   added: (in package10 truck1)
   goals met: 39 of 43
133. (drive-truck driver1 s1 s5 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   goals met: 39 of 43
134. (drive-truck driver1 s5 s3 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   goals met: 39 of 43
135. (unload-truck s3 package13 truck1)
   deleted: (in package13 truck1)
   added: (at package13 s3)
   goals met: 40 of 43
136. (unload-truck s3 package10 truck1)
   deleted: (in package10 truck1)
   added: (at package10 s3)
   goals met: 41 of 43
137. (drive-truck driver1 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 41 of 43
138. (load-truck s2 package14 truck1)
   deleted: (at package14 s2)
   added: (in package14 truck1)
   goals met: 41 of 43
139. (drive-truck driver1 s2 s5 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s5)
   goals met: 41 of 43
140. (unload-truck s5 package14 truck1)
   deleted: (in package14 truck1)
   added: (at package14 s5)
   goals met: 42 of 43
141. (drive-truck driver1 s5 s1 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   goals met: 42 of 43
142. (disembark-truck driver1 s1 truck1)
   deleted: (driving driver1 truck1)
   added: (at driver1 s1) (empty truck1)
   goals met: 43 of 43
